--- a/README.md
+++ b/README.md
@@ -365,74 +420,67 @@ From:
 
 - AMC Deployer - DeploymentServiceTest.concurrencyExceptionOnRepositoryShouldBeCaught
 
-```plantuml
+```mermaid
+sequenceDiagram
 
-@startuml
-skinparam maxMessageSize 20
-box "HTTP Client"
-  actor Client #lightblue
-end box
-Client ->> DeploymentService : update(deploymentId, DeploymentUpdateRequest)\n PATCH /deploymenys/{deploymentId
-DeploymentService ->> DeploymentRepository : get(deploymentId) : Deployment
-DeploymentService ->> DeploymentService : update(Deployment, DeploymentUpdateRequest, shouldTriggerPipeline)
+  actor Client 
 
-group within update(..)
-DeploymentService ->> TargetRegistry : getTarget(orgId, targetProviderCode, targetId, envId?) : TargetInfo
-TargetRegistry ->> AtlasClient: getTarget(orgId, wtProviderCode, targetId, envId?) : TargetInfo
-box "HTTP API"
-  participant AtlasAPI #lightblue
-end box
-AtlasClient ->> AtlasAPI : GET /api/v1\n/organizations/{orgId}\n/providers/{targetProviderCode}\n/targets/{targetId} 
-DeploymentService ->> TargetService : checkTargetAvailability\n(deploymentType, target, targetProviderCode)
-TargetService ->> TypeConfiguration : getConfiguration(deploymentType) : DeploymentTypeConfiguration
-TargetService ->> TargetService : isRequireAvailability && !DeploymentTypeConfiguration.isAvailableForDeployments
-note right : in mule cloud checks if there's at least a region available
+  rect rgb(174, 237, 245)
+    Client ->> DeploymentService : update(deploymentId, DeploymentUpdateRequest)<br> PATCH /deploymenys/{deploymentId
+  end
+  DeploymentService ->> DeploymentRepository : get(deploymentId) : Deployment
+  DeploymentService ->> DeploymentService : update(Deployment, DeploymentUpdateRequest, shouldTriggerPipeline)
+  DeploymentService ->> TargetRegistry : getTarget(orgId, targetProviderCode, targetId, envId?) : TargetInfo
+  TargetRegistry ->> AtlasClient: getTarget(orgId, wtProviderCode, targetId, envId?) : TargetInfo
 
-alt if changeSpec
+  participant AtlasAPI 
+  rect rgb(174, 237, 245)
+    AtlasClient ->> AtlasAPI : GET /api/v1<br>/organizations/{orgId}<br>/providers/{targetProviderCode}<br>/targets/{targetId} 
+  end
+  DeploymentService ->> TargetService : checkTargetAvailability<br>(deploymentType, target, targetProviderCode)
+  TargetService ->> TypeConfiguration : getConfiguration(deploymentType) : DeploymentTypeConfiguration
+  TargetService ->> TargetService : isRequireAvailability && !DeploymentTypeConfiguration.isAvailableForDeployments
+  note right of TargetService : in mule cloud checks if there's at least a region available
 
-  DeploymentService ->> DeploymentService : updateSpec(Deployment, DeploymentUpdateRequest, TargetInfo)
-  DeploymentService ->> SpecProcessor : update(Deployment, updateRequest.getSpec(), TargetInfo?) : Spec
-  note right: creates  a spec and validates the spec from \nAMC or AMF
+  alt if changeSpec
 
-  alt if decoratorIntegrationEnabled
+    DeploymentService ->> DeploymentService : updateSpec(Deployment, DeploymentUpdateRequest, TargetInfo)
+    DeploymentService ->> SpecProcessor : update(Deployment, updateRequest.getSpec(), TargetInfo?) : Spec
+    note right of SpecProcessor: creates  a spec and validates the spec from <br>AMC or AMF
 
-  SpecProcessor ->> DecoratorClient : getProcessedSpec(DeploymentSpecDTO)
-  DecoratorClient ->> DecoratorClient : performRequest(url, Object:DeploymentSpecDTO):ProcessedSpecDTO
-  box "HTTP API"
-  participant AMCDecorator #lightblue
-  end box
-  DecoratorClient ->> AMCDecorator: HTTP /specs/{version}/framework
-  SpecProcessor ->> ConfigurationProcessor : getConfigurationWithoutAssets\n(DeploymentAssetType.CONFIGURATION, ProcessedSpecDTO.\ngetConfigurationWithoutSecrets())
-  note left : Deploymnet.setSpec(Spec) - updates deployment spec.
+    alt if decoratorIntegrationEnabled
+
+      SpecProcessor ->> DecoratorClient : getProcessedSpec(DeploymentSpecDTO)
+      DecoratorClient ->> DecoratorClient : performRequest(url, Object:DeploymentSpecDTO):ProcessedSpecDTO
+      participant AMCDecorator 
+
+      rect rgb(174, 237, 245)
+        DecoratorClient ->> AMCDecorator: HTTP /specs/{version}/framework
+      end
+      SpecProcessor ->> ConfigurationProcessor : getConfigurationWithoutAssets<br>(DeploymentAssetType.CONFIGURATION, ProcessedSpecDTO.<br>getConfigurationWithoutSecrets())
+      note left of ConfigurationProcessor: Deploymnet.setSpec(Spec) - updates deployment spec.
+
+    end
 
   end
 
-end
+  alt if changeSpec || changeSpecVersion
+      DeploymentService ->> DeploymentService : Deployment.updateReplicas()
+      DeploymentService ->> DeploymentRepository : save(Deployment)
+  end
 
-alt if changeSpec || changeSpecVersion
-    DeploymentService ->> DeploymentService : Deployment.updateReplicas()
-    DeploymentService ->> DeploymentRepository : save(Deployment)
-end
-
-alt if updatedDeployment.specVersion != prevVersion && shouldTriggerPipeline (always true)
-  DeploymentService ->> TargetService : getReplicationStrategy\n(Deployment.getType(), Deployment.getTargetProvider().getCode(), TargetInfo): strategy
-  DeploymentService ->> BrokerPublisherWrapper : buildAndQueueDeployment\nReportMessagesWithStrategy(Deployment, OperationType.UPSERT, strategy)
-  note right : Builds and queues the messages for deployment to the \nQuotasBroker.
-  BrokerPublisherWrapper ->> QuotasMessageFactory : buildPipelineRequestMessage\n(Deployment, OperationType.Upsert, nodesIds, strategy)
-  group within buildPipeline..
+  alt if updatedDeployment.specVersion != prevVersion && shouldTriggerPipeline (always true)
+    DeploymentService ->> TargetService : getReplicationStrategy<br>(Deployment.getType(), Deployment.getTargetProvider().getCode(), TargetInfo): strategy
+    DeploymentService ->> BrokerPublisherWrapper : buildAndQueueDeployment<br>ReportMessagesWithStrategy(Deployment, OperationType.UPSERT, strategy)
+    note right of BrokerPublisherWrapper: Builds and queues the messages for deployment to the <br>QuotasBroker.
+    BrokerPublisherWrapper ->> QuotasMessageFactory : buildPipelineRequestMessage<br>(Deployment, OperationType.Upsert, nodesIds, strategy)
     QuotasMessageFactory ->> QuotasRequestMessage : new(..) : QuotasMessageRequest
-    QuotasMessageFactory ->> BrokerMessage : quotas("quotas.Deployments", \nQuotasMessageRequest, ..) : BrokerMessage<PipelineRequestMessage>
+    QuotasMessageFactory ->> BrokerMessage : quotas("quotas.Deployments", <br>QuotasMessageRequest, ..) : BrokerMessage<PipelineRequestMessage>
+    BrokerPublisherWrapper ->> BrokerPublisher : publish(BrokerMessage<PipelineRequestMessage>)
+    participant QuotasBroker 
+    BrokerPublisher ->> QuotasBroker : publish(..) quotas.Deployments
   end
-  BrokerPublisherWrapper ->> BrokerPublisher : publish(BrokerMessage<PipelineRequestMessage>)
-  box "Quotas Broker\nquotas.Deployments"
-    participant QuotasBroker #FF5733
-  end box
-  BrokerPublisher ->> QuotasBroker : publish(..) quotas.Deployments
-end
 
-end
-
-@enduml
 ```
 
 ### Process message back from quotas - JMS Listener
@@ -440,87 +488,89 @@ end
 JMS Broker: Quotas ; queue: quotas.DeploymentsReport
 Description: Deployer Process messages coming from quotas to move deployment to next phase or update the deployment if it was rejected.
 
-```plantuml
+```mermaid
 
-@startuml
-skinparam maxMessageSize 20
-box "Quotas Broker\nquotas.DeploymentsReport"
-actor Client #FF5733
-end box
-skinparam maxMessageSize 20
-participant "BrokerService" as bs
-Client ->> bs : quotas.DeploymentReport
-bs ->> QuotasBrokerSubscriber : processAsDeployerMessagesBackFromQuotas(\nTextMessage)
-note right: TextMessage gets  transformed to  QuotasReplyNotification
-QuotasBrokerSubscriber ->> DeploymentService : findByIdAndFetchSpecs(QuotasReplyNotification.getDeploymentId())\n:Deployment
+sequenceDiagram
 
-alt QuotasReplyNotification.getStatus().equals(APPROVED)
-  QuotasBrokerSubscriber ->> DeploymentService : updateReplicasForSelectedNodes(Deployment, QuotasReplyNotification.getNodes())
-  note left: It's not directly QuotasReplyNotification.getNodes() but a curated list
+  actor Client 
+  participant "BrokerService" as bs
 
-  alt if decoratorFeatureEnabled
-    QuotasBrokerSubscriber ->> DecoratorMessageFactory : buildSpecDecorationRequestMessage(Deployment, QuotasReplyNotification.getOperationType()):\nBrokerMessage\n<PipelineRequestMessage>
-    DecoratorMessageFactory ->> PipelineMessageUtils : transformDeploymentReportInformation(Deployment, includeFeatureFlags = true) : DeploymentReportInformation
-    
-    alt includeFeatureFlags
-      
-      PipelineMessageUtils ->> TargetService : getTargetInfo(Deployment) : TargetInfo
-      PipelineMessageUtils ->> PipelineMessageUtils : targetFeatureFlags = TargetInfo.featureFlags
-      note right #lightgreen: Review feature flags usage per target when making UMP a platform
-
-    end 
-
-    DecoratorMessageFactory ->> PipelineRequestMessage : new(Deployment.id, DeploymentReportInformation)
-    DecoratorMessageFactory ->> QuotasBrokerSubscriber : BrokerMessage<PipelineRequestMessage>
-    QuotasBrokerSubscriber ->> BrokerPublisher : publish(BrokerMessage)
-    note right: Builds a pipeline request message to start our \ndeployment pipeline.
-    box "decorator.SpecDecorationRequest"
-      participant DecoratorBroker #FF5733
-    end box
-    BrokerPublisher ->> DecoratorBroker : send(BrokerMessage) decorator.SpecDecorationRequest
-
-  else
-
-    QuotasBrokerSubscriber ->> DeploymentsMessageFactory : buildMessagesForDeploymentAndSpec(Deployment, QuotasReplyNotification.getSpecVersion(), \nQuotasReplyNotification\n.getSelectedNodes())
-    DeploymentsMessageFactory ->> QuotasBrokerSubscriber : List<BrokerMessage\n<DeploymentMessage>> 
-
-    QuotasBrokerSubscriber ->> BrokerPublisher : publish(\nList<BrokerMessage<DeploymentMessage>>) 
-    box "{nodeInfo.location}.Provider.\n{target.provider.code}.\nAgent.{nodeInfo.id}.State"
-      participant "TransportLayerBroker" #FF5733
-    end box
-    BrokerPublisher ->> TransportLayerBroker : publish each deployment message
-    note right: One message \nper node is sent \nto the target to \nexecute the deployment
-    QuotasBrokerSubscriber ->> BrokerPublisher : publish(BrokerMessage)
-    note right: Build transport messages for a deployment \nand each node \nof its target.
-
+  rect rgb(237, 76, 119)
+    Client ->> bs : quotas.DeploymentReport
   end
+  bs ->> QuotasBrokerSubscriber : processAsDeployerMessagesBackFromQuotas(<br>TextMessage)
+  note right of QuotasBrokerSubscriber: TextMessage gets  transformed to  QuotasReplyNotification
+  QuotasBrokerSubscriber ->> DeploymentService : findByIdAndFetchSpecs(QuotasReplyNotification.getDeploymentId())<br>:Deployment
 
+  alt QuotasReplyNotification.getStatus().equals(APPROVED)
+    QuotasBrokerSubscriber ->> DeploymentService : updateReplicasForSelectedNodes(Deployment, QuotasReplyNotification.getNodes())
+    note left of QuotasBrokerSubscriber: It's not directly QuotasReplyNotification.getNodes() but a curated list
 
-@enduml
+    alt if decoratorFeatureEnabled
+      QuotasBrokerSubscriber ->> DecoratorMessageFactory : buildSpecDecorationRequestMessage(Deployment, QuotasReplyNotification.getOperationType()):<br>BrokerMessage<br><PipelineRequestMessage>
+      DecoratorMessageFactory ->> PipelineMessageUtils : transformDeploymentReportInformation(Deployment, includeFeatureFlags = true) : DeploymentReportInformation
+      
+      alt includeFeatureFlags
+        
+        PipelineMessageUtils ->> TargetService : getTargetInfo(Deployment) : TargetInfo
+        PipelineMessageUtils ->> PipelineMessageUtils : targetFeatureFlags = TargetInfo.featureFlags
+        
+        rect reg(156, 247, 215) 
+          note right of PipelineMessageUtils: Review feature flags usage per target when making UMP a platform
+        end
+      end 
 
+      DecoratorMessageFactory ->> PipelineRequestMessage : new(Deployment.id, DeploymentReportInformation)
+      DecoratorMessageFactory ->> QuotasBrokerSubscriber : BrokerMessage<PipelineRequestMessage>
+      QuotasBrokerSubscriber ->> BrokerPublisher : publish(BrokerMessage)
+      note right of BrokerPublisher: Builds a pipeline request message to start our <br>deployment pipeline.
+      participant DecoratorBroker 
+
+      rect rgb(237, 76, 119)
+        BrokerPublisher ->> DecoratorBroker : send(BrokerMessage) decorator.SpecDecorationRequest
+      end
+
+    else -
+
+      QuotasBrokerSubscriber ->> DeploymentsMessageFactory : buildMessagesForDeploymentAndSpec(Deployment, QuotasReplyNotification.getSpecVersion(), <br>QuotasReplyNotification<br>.getSelectedNodes())
+      DeploymentsMessageFactory ->> QuotasBrokerSubscriber : List<BrokerMessage<br><DeploymentMessage>> 
+
+      QuotasBrokerSubscriber ->> BrokerPublisher : publish(<br>List<BrokerMessage<DeploymentMessage>>) 
+      participant "TransportLayerBroker" 
+      BrokerPublisher ->> TransportLayerBroker : publish each deployment message
+      note right of TransportLayerBroker: One message <br>per node is sent <br>to the target to <br>execute the deployment
+
+      rect rgb(237, 76, 119)
+        QuotasBrokerSubscriber ->> BrokerPublisher : publish(BrokerMessage)
+      end
+      note right of BrokerPublisher: Build transport messages for a deployment and each node of its target
+    end
+  end
 ```
 
 TODO add link between both diagrams
 
@@ -645,87 +699,91 @@ end
 
 Description: Deployer Process messages coming from decorator to complete deployment sending the message the TL or update the deployment if it was rejected.
 
-```plantuml
+```mermaid
 
-@startuml
-skinparam maxMessageSize 20
-box "decorator.SpecDecorationResult"
-  participant DecoratorBroker #FF5733
-end box
-DecoratorBroker ->> DecoratorBrokerSubscriber : processDecorationResult\n(DecorationReplyNotification)
-DecoratorBrokerSubscriber ->> DeploymentService : findByIdAndFetchSpecs\n(DecorationMessaggeNotification.\ngetDeploymentId()) : Deployment?
+sequenceDiagram
 
-alt Deployment is not empty OR Deployment.specVErsion != DecorationResultNotification.specVErsion
+  participant DecoratorBroker 
 
-  DecoratorBrokerSubscriber ->> DecoratorBrokerSubscriber : log error spec outdated  
+  rect rgb(237, 76, 119)
+    DecoratorBroker ->> DecoratorBrokerSubscriber : processDecorationResult<br>(DecorationReplyNotification)
+  end
+  DecoratorBrokerSubscriber ->> DeploymentService : findByIdAndFetchSpecs(DecorationMessaggeNotification.<br>getDeploymentId()) : Deployment?
 
-else 
+  alt Deployment is not empty OR Deployment.specVErsion != DecorationResultNotification.specVErsion
 
-  alt DecorationReplyNotification.status is DecorationStatus.SUCCESSFUL
+    DecoratorBrokerSubscriber ->> DecoratorBrokerSubscriber : log error spec outdated  
 
-    DecoratorBrokerSubscriber ->> DeploymentsMessageFactory : buildMessagesForDeploymentAndSpec\n(Deployment, \nDecorationReplyNotification.\nspecVersion, Deployment.nodeIds) \n: List<BrokerMessage<DeploymentMessage>>
-    DeploymentsMessageFactory ->> TargetService : getTargetInfo(Deployment) : TargetInfo
-    DeploymentsMessageFactory ->> DeploymentsMessageFactory : buildMessagesForDeployment\nSpecAndTarget(Deployment, \nDeployment.getSpec(Deployment.specVersion) \nas spec, TargetInfo, \nDeployment.nodeIds) : List<BrokerMessage<DeploymentMessage>>
-    DeploymentsMessageFactory ->> DeploymentsMessageFactory : getDeploymentMessageContent\n(Deployment, \nspec, TargetInfo) \n: DeploymentMessageContent
-    DeploymentsMessageFactory ->> DecoratedSpecFactory : \ngetDecoratedSpec(\nDeployment.type, \nDeployment.name, \ndeployment.targetProvider.code, spec)\n: DecoratedSpec 
+  else 
 
-    alt decoratorIntegrationEnabled
+    alt DecorationReplyNotification.status is DecorationStatus.SUCCESSFUL
 
-      DeploymentsMessageFactory ->> DecoratorService : getDecoratedSpecFromDecorator(\nDeployment, spec, \nDecorationVisibility.ALL)\n: DecoratedSpecDTO
-      DecoratorService ->> DecoratedSpecRequestDTO : new(..)
-      DecoratorService ->> DecoratorClient : getDecoratedSpec(\nDecoratedSpecRequestDTO): \nDecoratedSpecDTO
-      box "HTTP API"
-        participant AMCDecoratorAPI #lightblue
-      end box
-      DecoratorClient ->> AMCDecoratorAPI : /spec/{version}: DecoratorSpecDTO 
-      note right: Retrieves a spec \nalready decorated
-      DeploymentsMessageFactory ->> TargetInfo : getNodes() : Set<NodeInfo>
+      DecoratorBrokerSubscriber ->> DeploymentsMessageFactory : buildMessagesForDeploymentAndSpec<br>(Deployment, <br>DecorationReplyNotification.<br>specVersion, Deployment.nodeIds) <br>: List<BrokerMessage<DeploymentMessage>>
+      DeploymentsMessageFactory ->> TargetService : getTargetInfo(Deployment) : TargetInfo
+      DeploymentsMessageFactory ->> DeploymentsMessageFactory : buildMessagesForDeployment<br>SpecAndTarget(Deployment, <br>Deployment.getSpec(Deployment.specVersion) <br>as spec, TargetInfo, <br>Deployment.nodeIds) : List<BrokerMessage<DeploymentMessage>>
+      DeploymentsMessageFactory ->> DeploymentsMessageFactory : getDeploymentMessageContent<br>(Deployment, <br>spec, TargetInfo) <br>: DeploymentMessageContent
+      DeploymentsMessageFactory ->> DecoratedSpecFactory : <br>getDecoratedSpec(<br>Deployment.type, <br>Deployment.name, <br>deployment.targetProvider.code, spec)<br>: DecoratedSpec 
 
-      DeploymentsMessageFactory ->> DeploymentsMessageFactory : availableNodes = Set<NodeInfo> filter by Deployment.nodeIDs
+      alt decoratorIntegrationEnabled
 
-      alt optimizedFlexMessagePublication AND Deployment is in standalone 
+        DeploymentsMessageFactory ->> DecoratorService : getDecoratedSpecFromDecorator(<br>Deployment, spec, <br>DecorationVisibility.ALL)<br>: DecoratedSpecDTO
+        DecoratorService ->> DecoratedSpecRequestDTO : new(..)
+        DecoratorService ->> DecoratorClient : getDecoratedSpec(<br>DecoratedSpecRequestDTO): <br>DecoratedSpecDTO
+        participant AMCDecoratorAPI 
 
-        DeploymentsMessageFactory ->> DeploymentsMessageFactory : availableNodes = filter availableNodes which DeploymentState != APPLIED
-        
-        note right #lightgreen: Feature flag specific for flex to avoid publishing messages to nodes which the deployment is already applied
+        rect rgb(174, 237, 245)
+          DecoratorClient ->> AMCDecoratorAPI : /spec/{version}: DecoratorSpecDTO 
+        end
+        note right of AMCDecoratorAPI: Retrieves a spec <br>already decorated
+        DeploymentsMessageFactory ->> TargetInfo : getNodes() : Set<NodeInfo>
+
+        DeploymentsMessageFactory ->> DeploymentsMessageFactory : availableNodes = Set<NodeInfo> filter by Deployment.nodeIDs
+
+        alt optimizedFlexMessagePublication AND Deployment is in standalone 
+
+          DeploymentsMessageFactory ->> DeploymentsMessageFactory : availableNodes = filter availableNodes which DeploymentState != APPLIED
+          
+          rect reg(156, 247, 215) 
+            note right of DeploymentsMessageFactory: Feature flag specific for flex to avoid publishing messages to nodes which the deployment is already applied
+          end
+        end
+
+        loop availableNodes : nodeInfo 
+
+          DeploymentsMessageFactory ->> DeploymentsMessageFactory : buildMessageForNode(Deployment, TargetInfo, nodeInfo, spec, DeploymentMessageContent, TargetInfo.enhancedSecurity)
+
+        end
+
+        DeploymentsMessageFactory ->> DecoratorBrokerSubscriber : List<BrokerMessage<br><DeploymentMessage>> 
 
       end
 
-      loop availableNodes : nodeInfo 
+      DecoratorBrokerSubscriber ->> BrokerPublisher : publish(<br>List<BrokerMessage<DeploymentMessage>>) 
+        participant "TransportLayerBroker" 
 
-        DeploymentsMessageFactory ->> DeploymentsMessageFactory : buildMessageForNode(Deployment, TargetInfo, nodeInfo, spec, DeploymentMessageContent, TargetInfo.enhancedSecurity)
-
+      rect rgb(237, 76, 119)
+        BrokerPublisher ->> TransportLayerBroker : publish each deployment message
       end
+      note right of TransportLayerBroker: One message <br>per node is sent <br>to the target to <br>execute the deployment
+    
+    else 
 
-      DeploymentsMessageFactory ->> DecoratorBrokerSubscriber : List<BrokerMessage\n<DeploymentMessage>> 
+      DecoratorBrokerSubscriber ->> DeploymentNotificationService : updateStatusForARejectedDeploymnet(Deployment, DecorationReplyNotification.reason, DeploymentState.FAILED)
 
     end
 
-    DecoratorBrokerSubscriber ->> BrokerPublisher : publish(\nList<BrokerMessage<DeploymentMessage>>) 
-    box "{nodeInfo.location}.Provider.\n{target.provider.code}.\nAgent.{nodeInfo.id}.State"
-      participant "TransportLayerBroker" #FF5733
-    end box
-    BrokerPublisher ->> TransportLayerBroker : publish each deployment message
-    note right: One message \nper node is sent \nto the target to \nexecute the deployment
-  
-  else 
-
-    DecoratorBrokerSubscriber ->> DeploymentNotificationService : updateStatusForARejectedDeploymnet(Deployment, DecorationReplyNotification.reason, DeploymentState.FAILED)
+    DecoratorBrokerSubscriber ->> TrackingMessageService : untrack(DecorationReplyNotification.deploymentId, DecorationReplyNotification.deploymentId, DecorationReplyNotification.specVersion)
 
   end
 
-  DecoratorBrokerSubscriber ->> TrackingMessageService : untrack(DecorationReplyNotification.deploymentId, DecorationReplyNotification.deploymentId, DecorationReplyNotification.specVersion)
 
-end
-
-@enduml
 ```
 
 ## Destroy -- Document
